УТ_для_edt/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/CRM_УчетныеЗаписиМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УчетныеЗаписиМессенджеров</name>
  <predefined>
    <items>
      <name>B2BПортал</name>
      <description>B2B портал</description>
    </items>
    <items>
      <name>СистемаВзаимодействия</name>
      <description>Система взаимодействия</description>
    </items>
  </predefined>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Включена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПросмотрСообщенийВсемПользователям</name>
    <comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметровДоступа</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьIDГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаНачальнойЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТокен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТокенГруппы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWebhook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодWebhook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерГруппа</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерСтатусРаботы</name>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СоздаватьПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияИспользованияПриняты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВариантАвтосозданияКлиентов</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>EnumRef.CRM_ВариантыАвтосозданияКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>смартГруппаПользователя</name>
    <comment>//++ #Б-3538 смарт: Фролов 10.06.2025 //Иерархия учетных записей мессенджеров и социальных сетей </comment>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>смартПодразделениеПользователя</name>
    <comment>//++ #Б-3538 смарт: Фролов 10.06.2025 //Иерархия учетных записей мессенджеров и социальных сетей </comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Сценарии</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/смартИнтеграцияWhatsApp/Module.bsl
/////////////////////////////////////////////////////////////////////////////
// Модуль смартИнтеграцияWhatsApp предназначен для 
// хранения процедур и функций, связанных с обменом  
// данными с мессенджером WhatsApp
/////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ВыполнитьЗаданиеПроверкаСтатусовИнстансовWhatsApp(Параметры = Неопределено) Экспорт
	
	ПроверкаОтправкаНаПочтуСтатусовИнстансовWhatsApp();

КонецПроцедуры

Процедура ПроверкаОтправкаНаПочтуСтатусовИнстансовWhatsApp() Экспорт
	
	GreenAPIАдрес = Справочники.смартПредопределенныеЗначения.Настройки.GreenAPIАдрес;
	АдресПочтыДляОшибокWhatsApp = Справочники.смартПредопределенныеЗначения.Настройки.АдресПочтыДляОшибокWhatsApp;
	
	Если НЕ ЗначениеЗаполнено(АдресПочтыДляОшибокWhatsApp)
		ИЛИ НЕ ЗначениеЗаполнено(GreenAPIАдрес) Тогда
		Возврат;
	КонецЕсли;	
	
	МассивОшибок = Новый Массив;

	УспешныйСтатус = "authorized";
	
	УчетныеЗаписиДляПроверки = ПолучитьДействующиеУчетныеЗаписиМессенджеров("WhatsApp");
	
	Для Каждого УчетнаяЗапись Из УчетныеЗаписиДляПроверки Цикл
		
		Статус = ПолучитьСтатусИнстансаWhatsApp(УчетнаяЗапись, GreenAPIАдрес);
		
		Если ЗначениеЗаполнено(Статус) 
			И Статус <> УспешныйСтатус Тогда
			
			СтруктураОшибки = Новый Структура;
			
			СтруктураОшибки.Вставить("УчетнаяЗапись", УчетнаяЗапись.Ссылка);
			СтруктураОшибки.Вставить("Ответственный", УчетнаяЗапись.Ответственный);
			СтруктураОшибки.Вставить("Статус", 		  Статус);
			
			МассивОшибок.Добавить(СтруктураОшибки);
			
		КонецЕсли;
		
	КонецЦикла;	

	Если МассивОшибок.Количество() > 0 Тогда
		
		ТексОшибокWhatsApp = "";
		
		Для Каждого СтруктураОшибки Из МассивОшибок Цикл
			
			ТексОшибокWhatsApp = ТексОшибокWhatsApp 
				+ СокрЛП(СтруктураОшибки.УчетнаяЗапись) + " - "
				+ СокрЛП(СтруктураОшибки.Ответственный) + " - "
				+ СокрЛП(СтруктураОшибки.Статус) + Символы.ПС;
				
		КонецЦикла;
			
		//Отправка письма с ошибками
		ДанныеДляОтправки = Новый Структура;
		ДанныеДляОтправки.Вставить("Кому", 		АдресПочтыДляОшибокWhatsApp); 
	    ДанныеДляОтправки.Вставить("Тема", 		"Неавторизованные пользователи WhatsApp!");
		ДанныеДляОтправки.Вставить("Тело", 		ТексОшибокWhatsApp); 
	    ДанныеДляОтправки.Вставить("ТипТекста", ТипТекстаПочтовогоСообщения.ПростойТекст);
	    ДанныеДляОтправки.Вставить("Важность", 	ВажностьИнтернетПочтовогоСообщения.Высокая);

		УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ДанныеДляОтправки); 
		
	КонецЕсли;	

КонецПроцедуры

Функция ПолучитьСтатусИнстансаWhatsApp(УчетнаяЗапись, GreenAPIАдрес) Экспорт
	
	Результат = Неопределено;
	
	ПараметрыУчетнойЗаписи = УчетнаяЗапись.ХранилищеПараметровДоступа.Получить();
	
	ПараметрыЗапроса = Новый Соответствие;
	
	ПараметрыЗапроса.Вставить("API", 	   		  GreenAPIАдрес);
	ПараметрыЗапроса.Вставить("idInstance", 	  ПараметрыУчетнойЗаписи.ApiURL);
	ПараметрыЗапроса.Вставить("apiTokenInstance", ПараметрыУчетнойЗаписи.Токен);
	
	HTTPОтвет = ВыполнитьЗапросGreenApi("GET", ПараметрыЗапроса, "GetStateInstance");

	Если HTTPОтвет.КодСостояния = 200 Тогда

		ДанныеJSON = ПрочитатьОбъектИзJSON(HTTPОтвет.ПолучитьТелоКакСтроку());
		
		Если ТипЗнч(ДанныеJSON) = Тип("Структура") 
			И ДанныеJSON.Свойство("stateInstance") Тогда 
			
			Результат = ДанныеJSON.stateInstance;										
														
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДействующиеУчетныеЗаписиМессенджеров(Мессенджер)

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ссылка,
	|	Включена,
	|	Ответственный,
	|	ТипМессенджера,
	|	УникальныйИдентификаторЗадания,
	|	ХранилищеПараметровДоступа
	|ИЗ
	|	Справочник.CRM_УчетныеЗаписиМессенджеров
	|ГДЕ
	|	Включена
	|	И ТипМессенджера В (&Мессенджер)
	|	
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Мессенджер", Мессенджер);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ВыполнитьЗапросGreenApi(ВидЗапроса, ПараметрыЗапроса, Метод, ТелоЗапроса = "")
	
	URL = ПараметрыЗапроса.Получить("API");
	АдресРесурса = ПолучитьАдресЗапросаGreenApi(ПараметрыЗапроса, Метод);
	
	Заголовки = Новый Соответствие;
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);

	Соединение = Новый HTTPСоединение(URL, , , , , , ЗащищенноеСоединение);
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	
	Если ВРег(ВидЗапроса) = "GET" Тогда
		
		HTTPОтвет = Соединение.Получить(HTTPЗапрос);
		
	ИначеЕсли ВРег(ВидЗапроса) = "POST" Тогда
		
		Если ТелоЗапроса <> Неопределено И ТипЗнч(ТелоЗапроса) = Тип("Строка") Тогда
			HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		ИначеЕсли ТелоЗапроса <> Неопределено И ТипЗнч(ТелоЗапроса) = Тип("ДвоичныеДанные") Тогда
			HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
		КонецЕсли;
	 
	    HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	КонецЕсли;
	
	Возврат HTTPОтвет;
	
КонецФункции

//Функция получения адреса запроса Green-Api
Функция ПолучитьАдресЗапросаGreenApi(ПараметрыЗапроса, Метод)

	Instance 	  = "/" + "waInstance" + ПараметрыЗапроса.Получить("idInstance");
	Service		  = "/" + Метод;
	TokenInstance = "/" + ПараметрыЗапроса.Получить("apiTokenInstance");
				
	АдресРесурса = Instance + Service + TokenInstance;
	
	Возврат АдресРесурса;
	
КонецФункции

#КонецОбласти

#Область Прочее

// Десериализует строку JSON в структуру или соответствие
//
// Параметры:
//  Строка - Строка
//
// Возвращаемое значение:
//  Структура или соответствие.
//
Функция ПрочитатьОбъектИзJSON(Стр, Соответствие = Ложь)
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Стр);
	Попытка
    	Объект = ПрочитатьJSON(Чтение, Соответствие);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Объект = Неопределено;
	КонецПопытки;
	
    Возврат Объект;
	
КонецФункции

#КонецОбласти
